{
  "id": "cyber-ethics-issues-module-14",
  "title": "Cyber Ethics Issues (Module 14)",
  "description": "Identification review covering cybersex, pornography, cyberbullying, and their ethical implications.",
  "icon": "💻",
  "flashcards": [
    {
      "id": 1,
      "front": "What is cybersex or online sex?",
      "back": "A social interaction of at least two persons engaging in real time digital messages or live camera feed conversations to become sexually aroused and satisfied"
    },
    {
      "id": 2,
      "front": "According to the Oxford Dictionary, what does cybersex refer to?",
      "back": "Sexual arousal using computer technology, especially by wearing virtual reality equipment or by exchanging messages with another person via the Internet"
    },
    {
      "id": 3,
      "front": "What relationships does cybersex negatively affect?",
      "back": "Relationships with both humans and God"
    },
    {
      "id": 4,
      "front": "What are the classical forms that cybersex is defined as?",
      "back": "Forms of lust and fornication"
    },
    {
      "id": 5,
      "front": "In 2012, what was the average amount of time people spent on cybersex-related activities per week?",
      "back": "Eleven hours per week"
    },
    {
      "id": 6,
      "front": "According to the 2016 Zur Institute report, how many pornographic websites exist?",
      "back": "4.2 million pornographic websites"
    },
    {
      "id": 7,
      "front": "According to the 2016 Zur Institute report, how many hits do pornographic sites get daily?",
      "back": "372 million hits daily"
    },
    {
      "id": 8,
      "front": "What are the six ethical issues related to cybersex?",
      "back": "1) Demarginalizes the sexual self (Reductionism) 2) Alters essence of sexuality (Commodification) 3) Debases the person as embodied spirit (Hedonism) 4) Corrupts perception of the body (Lust) 5) Denies spirituality in body and sex 6) Degenerates values (New Normal)"
    },
    {
      "id": 9,
      "front": "What does the first ethical issue of cybersex involve?",
      "back": "Demarginalizes the sexual self (Reductionism)"
    },
    {
      "id": 10,
      "front": "What does the second ethical issue of cybersex involve?",
      "back": "Alters essence of sexuality (Commodification)"
    },
    {
      "id": 11,
      "front": "What does the third ethical issue of cybersex involve?",
      "back": "Debases the person as embodied spirit (Hedonism)"
    },
    {
      "id": 12,
      "front": "What does the fourth ethical issue of cybersex involve?",
      "back": "Corrupts one's perception of the body (Lust)"
    },
    {
      "id": 13,
      "front": "What does the fifth ethical issue of cybersex involve?",
      "back": "Denies spirituality in the body and sex (Love as a three letter word)"
    },
    {
      "id": 14,
      "front": "What does the sixth ethical issue of cybersex involve?",
      "back": "Degenerates values (New Normal)"
    },
    {
      "id": 15,
      "front": "When does sexuality become especially salient during the life cycle?",
      "back": "During adolescence"
    },
    {
      "id": 16,
      "front": "What tasks do adolescents face regarding their sexuality?",
      "back": "Adjusting to their developing sexuality, increased sexual drive and interest in sex, and constructing their sexual selves"
    },
    {
      "id": 17,
      "front": "What has pornography historically been closely connected with?",
      "back": "The rise of communication technologies"
    },
    {
      "id": 18,
      "front": "What three technological advances have accelerated the pornography trend in recent decades?",
      "back": "Digitalization of data, the Internet, and the World Wide Web"
    },
    {
      "id": 19,
      "front": "What is another term for electronic pornography?",
      "back": "Cybersex"
    },
    {
      "id": 20,
      "front": "What is the relationship between cybersex and pornography?",
      "back": "They are interrelated; when one is engaged in pornography, they are also lured into cybersex"
    },
    {
      "id": 21,
      "front": "Who are often the victims in pornography cases?",
      "back": "Helpless victims like children"
    },
    {
      "id": 22,
      "front": "According to Save the Children Philippines, what has increased amid the COVID-19 pandemic?",
      "back": "Online sexual abuse of children"
    },
    {
      "id": 23,
      "front": "Why are more children at risk from online sexual abuse during COVID-19?",
      "back": "Families resort to easy money due to deepening poverty, and children are not allowed to leave homes"
    },
    {
      "id": 24,
      "front": "What is the theme of the Safer Internet Day for Children in the Philippines?",
      "back": "Bagong Normal: Ligtas na Internet for All"
    },
    {
      "id": 25,
      "front": "According to Atty. Alberto Muyot, what type of crisis is the pandemic?",
      "back": "A child rights crisis (not just a health crisis)"
    },
    {
      "id": 26,
      "front": "What percentage increase in OSAEC cases occurred during March-May 2020 compared to 2019?",
      "back": "264.6 percent increase (202,605 more reports)"
    },
    {
      "id": 27,
      "front": "How many OSAEC cases were reported during March-May 2020?",
      "back": "279,166 cases (76,561 in 2019 + 202,605 increase)"
    },
    {
      "id": 28,
      "front": "What is Republic Act 9775?",
      "back": "The Anti-Child Pornography Act of 2009"
    },
    {
      "id": 29,
      "front": "What is SaferKidsPH?",
      "back": "An Australian government initiative to reduce online sexual abuse and exploitation of children in the Philippines"
    },
    {
      "id": 30,
      "front": "What three organizations implement SaferKidsPH?",
      "back": "The Asia Foundation, UNICEF, and Save the Children Philippines"
    },
    {
      "id": 31,
      "front": "What is cyberbullying?",
      "back": "Bullying that takes place over digital devices like cell phones, computers, and tablets"
    },
    {
      "id": 32,
      "front": "Through what means can cyberbullying occur?",
      "back": "Through SMS, text, apps, or online in social media, forums, or gaming"
    },
    {
      "id": 33,
      "front": "What does cyberbullying include?",
      "back": "Sending, posting, or sharing negative, harmful, false, or mean content about someone else, including sharing personal or private information causing embarrassment or humiliation"
    },
    {
      "id": 34,
      "front": "When does cyberbullying cross into illegal behavior?",
      "back": "When it becomes unlawful or criminal behavior"
    },
    {
      "id": 35,
      "front": "What does the content shared online create?",
      "back": "A permanent public record (online reputation) accessible to schools, employers, colleges, and others"
    },
    {
      "id": 36,
      "front": "Who can be harmed by cyberbullying in terms of reputation?",
      "back": "Everyone involved – the person being bullied, those doing the bullying, and those participating in it"
    },
    {
      "id": 37,
      "front": "According to the USL College Student Handbook (2014), what is Major Offense No. 36?",
      "back": "Use of computing facilities to post/upload/send obscene, vulgar, indecent, gross, injurious, demeaning, insulting, humiliating, degrading, malicious, abusive, devoid of moral values, or harassing photos/videos/messages"
    },
    {
      "id": 38,
      "front": "What types of bullying are listed as Major Offense No. 56 in the USL Student Handbook?",
      "back": "School bullying, verbal bullying, text bullying, physical bullying, cyber bullying, serial bullying, secondary bullying, pair bullying, and gang bullying"
    },
    {
      "id": 39,
      "front": "What is the sanction for the first offense of Major Offense No. 56?",
      "back": "Suspension to non-readmission"
    },
    {
      "id": 40,
      "front": "What is the sanction for the second offense of Major Offense No. 56?",
      "back": "Non-readmission to exclusion or dismissal"
    },
    {
      "id": 41,
      "front": "Why is cyberbullying an issue in ethics?",
      "back": "Respect to oneself and others is at stake"
    },
    {
      "id": 42,
      "front": "What is the theological basis for respecting oneself and others?",
      "back": "Being created in God's image and likeness"
    },
    {
      "id": 43,
      "front": "What sin incites people into cyberbullying?",
      "back": "Pride"
    },
    {
      "id": 44,
      "front": "What type of act is cyberbullying especially to innocent people?",
      "back": "An act of injustice"
    },
    {
      "id": 45,
      "front": "What does cyberbullying lead to in the community?",
      "back": "A chaotic relationship with others in the community"
    }
  ]
}