{
  "id": "module-17-culture-values",
  "title": "Module 17 — Culture & Filipino Values",
  "description": "Coverage of culture's role in moral behavior, cultural relativism, and specific Filipino moral values.",
  "icon": "🇵🇭",
  "flashcards": [
    {
      "id": 1,
      "front": "What term refers to a being capable of distinguishing right from wrong and is held accountable for their actions?",
      "back": "Moral Agent"
    },
    {
      "id": 2,
      "front": "This is not an innate trait but the outcome of the interaction between an individual and society.",
      "back": "Moral Consciousness"
    },
    {
      "id": 3,
      "front": "Defined as the sum of symbols, ideas, forms, expressions, beliefs, and laws linked to a social system.",
      "back": "Culture"
    },
    {
      "id": 4,
      "front": "What type of culture consists of tangible objects like tools, artifacts, and clothing?",
      "back": "Material Culture"
    },
    {
      "id": 5,
      "front": "What type of culture consists of beliefs, values, laws, and customs, and is significant for setting moral standards?",
      "back": "Non-Material Culture"
    },
    {
      "id": 6,
      "front": "The process of acquiring moral sensibilities, attitudes, and skills to become morally mature.",
      "back": "Moral Development"
    },
    {
      "id": 7,
      "front": "What are the three ways through which moral development is learned?",
      "back": "1. Imitation\n2. Indoctrination\n3. Social Conditioning"
    },
    {
      "id": 8,
      "front": "The view that a person’s beliefs and values should be understood within their own culture rather than judged against another's.",
      "back": "Cultural Relativism"
    },
    {
      "id": 9,
      "front": "What is the core maxim of Cultural Relativism regarding truth?",
      "back": "\"What is true to you may not be true to me\" (No Universal Truth)"
    },
    {
      "id": 10,
      "front": "According to Cultural Relativism, what determines what is 'right' within a society?",
      "back": "The moral code of that society"
    },
    {
      "id": 11,
      "front": "What are the five claims of Cultural Relativism?",
      "back": "1. Different societies have different moral codes.\n2. The moral code of a society determines what is right.\n3. There is no objective, universal moral truth.\n4. No society’s moral code has special status.\n5. Judging other cultures is arrogant; we should be tolerant."
    },
    {
      "id": 12,
      "front": "What are the main strengths of Cultural Relativism?",
      "back": "Promotes cooperation, tolerance, and reduces cultural bias."
    },
    {
      "id": 13,
      "front": "What are the main weaknesses of Cultural Relativism?",
      "back": "Encourages moral subjectivism, limits collective moral progress, and risks moral disorder."
    },
    {
      "id": 14,
      "front": "A Filipino value representing a sense of shame driven by the fear of deviating from social norms.",
      "back": "Hiya"
    },
    {
      "id": 15,
      "front": "A Filipino concept referring to concern for self-esteem and social standing.",
      "back": "Amor Propio"
    },
    {
      "id": 16,
      "front": "The Filipino value of shared identity and the foundation of 'bayanihan'.",
      "back": "Pakikipag-kapwa tao"
    },
    {
      "id": 17,
      "front": "The Filipino value that regards the family as the core of responsibility and security.",
      "back": "Family Orientation"
    },
    {
      "id": 18,
      "front": "The Filipino ability to be optimistic and resilient even in tough times.",
      "back": "Joy and Humor"
    },
    {
      "id": 19,
      "front": "The Filipino value characterized by adaptability, creativity, and an organic sense of time.",
      "back": "Flexibility"
    },
    {
      "id": 20,
      "front": "The ambivalent Filipino value that can mean 'trust in God' (courage) OR passivity (resignation).",
      "back": "Bahala Na"
    },
    {
      "id": 21,
      "front": "The ambivalent Filipino value representing deep gratitude OR a burden of reciprocity.",
      "back": "Utang na Loob"
    },
    {
      "id": 22,
      "front": "The ambivalent Filipino value regarding standing by one's word.",
      "back": "Palabra de Honor"
    },
    {
      "id": 23,
      "front": "The ambivalent Filipino value that can mean support/networking OR corruption/favoritism.",
      "back": "Padrino System"
    },
    {
      "id": 24,
      "front": "According to Shalom Schwartz, what are the three shared universal value domains?",
      "back": "1. Power, Achievement, Pleasure\n2. Self-direction, Benevolence\n3. Tradition, Conformity, Security"
    },
    {
      "id": 25,
      "front": "What is the Latin origin of the word 'culture' and its meaning?",
      "back": "\"Cultus\" — meaning care or nurturing"
    },
    {
      "id": 26,
      "front": "Who defined culture as 'the sum of symbols, ideas, forms, and expressions linked to a social system'?",
      "back": "Allan G. Johnson"
    },
    {
      "id": 27,
      "front": "Who are the key providers of culture mentioned in the module?",
      "back": "Family, School, Church, Government, Workplace"
    },
    {
      "id": 28,
      "front": "What specific example is used to illustrate Cultural Relativism regarding suicide?",
      "back": "It is considered immoral in the Philippines (Catholic) but was honorable in wartime Japan (Seppuku)"
    },
    {
      "id": 29,
      "front": "Which Filipino value refers to a deep belief in God that influences daily decisions?",
      "back": "Faith and Religiosity"
    },
    {
      "id": 30,
      "front": "Which Filipino value represents the willingness to sacrifice and persevere?",
      "back": "Hard Work"
    },
    {
      "id": 31,
      "front": "Which Filipino value is defined by warmth and friendliness to strangers?",
      "back": "Hospitality"
    },
    {
      "id": 32,
      "front": "What famous quote describes the reciprocal relationship between humans and society?",
      "back": "\"People make culture, but culture also makes people.\""
    },
    {
      "id": 33,
      "front": "What is the synthesis or conclusion regarding Universal Values?",
      "back": "Despite cultural differences, humanity shares a common moral foundation (e.g., benevolence, security)."
    }
  ]
}